examples/openfoam-hydrofoil-flap/local_case/constant/momentumTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType laminar;

laminar
{
    model Stokes;
}
