examples/openfoam-hydrofoil-flap/local_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          27;
        startFace       4001;
    }
    outlet
    {
        type            patch;
        nFaces          27;
        startFace       4028;
    }
    hydrofoilFlap
    {
        type            wall;
        inGroups        1(wall);
        nFaces          76;
        startFace       4055;
    }
    farfield
    {
        type            wall;
        inGroups        1(wall);
        nFaces          76;
        startFace       4131;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4104;
        startFace       4207;
    }
)

// ************************************************************************* //
