examples/openfoam-hydrofoil-flap/local_case/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
transportModel Newtonian;
nu 3.2430769231e-04;
