examples/openfoam-hydrofoil-flap/local_case/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices
(
    (0.00000000 0.00000000 0.00000000)
    (0.00000000 0.16000000 0.00000000)
    (0.34000000 0.00000000 0.00000000)
    (0.34000000 0.16000000 0.00000000)
    (0.78144000 0.00172500 0.00000000)
    (0.78144000 0.16000000 0.00000000)
    (0.82384000 0.00730707 0.00000000)
    (0.82384000 0.16000000 0.00000000)
    (0.96000000 0.02350787 0.00000000)
    (0.96000000 0.16000000 0.00000000)
    (1.61967961 0.04407035 0.00000000)
    (1.62000000 0.16000000 0.00000000)
    (0.00000000 0.00000000 0.05000000)
    (0.00000000 0.16000000 0.05000000)
    (0.34000000 0.00000000 0.05000000)
    (0.34000000 0.16000000 0.05000000)
    (0.78144000 0.00172500 0.05000000)
    (0.78144000 0.16000000 0.05000000)
    (0.82384000 0.00730707 0.05000000)
    (0.82384000 0.16000000 0.05000000)
    (0.96000000 0.02350787 0.05000000)
    (0.96000000 0.16000000 0.05000000)
    (1.61967961 0.04407035 0.05000000)
    (1.62000000 0.16000000 0.05000000)
);
blocks
(
    hex (0 2 3 1 12 14 15 13) (14 27 1) simpleGrading (1 1 1)
    hex (2 4 5 3 14 16 17 15) (18 27 1) simpleGrading (1 1 1)
    hex (4 6 7 5 16 18 19 17) (8 27 1) simpleGrading (1 1 1)
    hex (6 8 9 7 18 20 21 19) (8 27 1) simpleGrading (1 1 1)
    hex (8 10 11 9 20 22 23 21) (28 27 1) simpleGrading (1 1 1)
);
edges ();
boundary
(
    inlet { type patch; faces (
        (0 1 13 12)
    ); }
    outlet { type patch; faces (
        (10 22 23 11)
    ); }
    hydrofoilFlap { type wall; faces (
        (0 2 14 12)
        (2 4 16 14)
        (4 6 18 16)
        (6 8 20 18)
        (8 10 22 20)
    ); }
    farfield { type wall; faces (
        (1 13 15 3)
        (3 15 17 5)
        (5 17 19 7)
        (7 19 21 9)
        (9 21 23 11)
    ); }
    frontAndBack { type empty; faces (
        (0 1 3 2)
        (2 3 5 4)
        (4 5 7 6)
        (6 7 9 8)
        (8 9 11 10)
        (12 14 15 13)
        (14 16 17 15)
        (16 18 19 17)
        (18 20 21 19)
        (20 22 23 21)
    ); }
);
mergePatchPairs ();
