examples/openfoam-hydrofoil-flap/local_case/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application simpleFoam;
startFrom latestTime; startTime 0; stopAt endTime; endTime 75;
deltaT 1; writeControl timeStep; writeInterval 1; purgeWrite 0;
writeFormat ascii; writePrecision 8; timeFormat general; timePrecision 8;
runTimeModifiable false;
