examples/openfoam-hydrofoil-flap/local_case/system/forceCoeffsDict
type forceCoeffs;
libs (forces);

patches (hydrofoilFlap);

rho rhoInf;
rhoInf 1000;

CofR (0 0 0);

liftDir (0 1 0);
dragDir (1 0 0);
pitchAxis (0 0 1);

magUInf 3.4;
lRef 0.96;
Aref 0.048;