examples/openfoam-hydrofoil-flap/local_case/system/forcesDict
type            forces;
libs            (forces);

patches         (hydrofoilFlap);

rho             rhoInf;
rhoInf          1000;

CofR            (0 0 0);
